{"bike":{"frame_model":"Daisy (Legacy Edition)","manufacturer":"Heritage","year":2014,"description":"Heritage Bicycles is proud to introduce The Daisy – Legacy Edition, a fully-loaded, take no prisoners town and country bike. We went nuts on the all componentry. The cranks, chain, stem, seatpost, you name it. Everything down to the bolts and bearings has received the type of attention that would make Swiss Watches jealous. The frames are hand-picked (we literally said “yes,”, “yes”, “no”, “yes”…) and produced with the highest standard of quality to give you the best ride and style. The Daisy Legacy sports sunshine yellow powder coating, walnut wenge fenders, an aged brown Brooks leather saddle, and Brooks grips. (We were feeling inspired by the season when designing this color palette.) Be ready-to-ride with a 2-speed kickshift hub and a cableless shift system that discreetly harnesses the power necessary to fly up hills and mash past the slow pokes. Rim brakes provide the ability to stop on a dime, custom wooden fenders to keep you dry, and painted-to-match front & rear racks. There is a small chance we may be a bit biased, but The Daisy – Legacy Edition is truly a beautiful bicycle, our finest piece of craftsmanship to date, and worthy of being passed down for generations. Frame: Daisy (Small or Large). Handmade with the highest quality standards. Paint: Sunshine yellow powder coat with “Heritage Chicago” details Rims: 700c high polish silver deep alloy with machined sidewall Spokes: Front: radial lace stainless; Rear:double cross laced stainless, black nipples Hubs: Front: lightweight alloy track hub 32 hole. Rear: Sturmey Archer 2 speed kickshift with a freewheel, black or silver. Bolted on with vintage style wingnuts on front. Tires: 700x35 with reflective strip Fenders: Wenge and walnut wood | 2 inch wide, full coverage Brakes: polished cantilever road brakes, city lever, black housing, chrome cable clips Bars: high polish mustache bars Stem: quill stem adapted to polished Grips: Brooks slender, aged finish Saddle: Brooks Flyer, black steel rails and springs, aged finish Seat post: alloy set back, high polish, single bolt integrated clamp Cranks: high polish silver alloy, interchangeable chainring Pedals: city platform, alloy, sealed bearings, silver Chain: Heavy duty, single speed, silver Bottom Bracket: english threaded, square tapered, sealed cartridge bearings Headset: high polish grand cru sealed bearing headset Racks: painted to match, front and rear.","original_msrp":"$1,850.00","paint_description":[null],"manufacturers_url":"http://www.heritagebicycles.com/collections/bicycles/products/daisy-legacy-edition","rear_wheel_bsd":622,"rear_tire_narrow":"true","stock_photo_url":"https://bikebook.s3.amazonaws.com/uploads/Fr/13327/IMG_1774_grande_1024x1024.jpg","stock_photo_small":"https://bikebook.s3.amazonaws.com/uploads/Fr/13327/medium_IMG_1774_grande_1024x1024.jpg"},"components":[]}