{"bike":{"frame_model":"The Chief (Legacy Edition)","manufacturer":"Heritage","year":2014,"description":"Heritage Bicycles is proud to introduce The Chief – Legacy Edition, a fully-loaded, take no prisoners road bike. We went nuts on the all componentry. The cranks, chain, stem, seatpost, you name it. Everything down to the bolts and bearings has received the type of attention that would make Swiss Watches jealous. The frames are hand-picked (we literally said “yes,”, “yes”, “no”, “yes”…) and produced with the highest standard of quality to give you the best ride and style. The Chief Legacy sports Oxblood Red powder coating, walnut wenge fenders, an aged brown Brooks leather saddle, and Brooks grips. (We were feeeling inspired by the season when designing this color pallette.) Be ready-to-ride with a 2-speed kickshift hub and a cableless shift system that discreetly harnesses the power necessary to fly up hills and mash past the slow pokes. Rim brakes provide the ability to stop on a dime, custom wooden fenders to keep you dry, and painted-to-match front & rear racks. There is a small chance we may be a bit biased, but The Chief – Legacy Edition is truly a beautiful bicycle, our finest piece of craftsmanship to date, and worthy of being passed down for generations. Click here to see more pictures Heritage conventional diamond frame, handcrafted in Chicago with American High-Tensile steel. •Sturmey-Archer 2-speed kick-back hub •Brooks B17 leather saddle •Brooks Slender Leather grips •Soma Lauterwasser Alloy handlebars •Tektro Brakes •Velo-Orange Chainguard •Woody’s Custom wood fenders •FSA Gimondi Crankset •Velo-Orange Constructeur front & rear racks •Schwalbe Delta Cruiser tires with K-Guard® •Velo-Orange Porteur Center-Stand","original_msrp":"$1,850.00","paint_description":[null],"manufacturers_url":"http://www.heritagebicycles.com/collections/bicycles/products/chief-legacy","rear_wheel_bsd":622,"rear_tire_narrow":"true","stock_photo_url":"https://bikebook.s3.amazonaws.com/uploads/Fr/13326/02H_1024x1024.jpg","stock_photo_small":"https://bikebook.s3.amazonaws.com/uploads/Fr/13326/medium_02H_1024x1024.jpg"},"components":[]}