{"bike":{"frame_model":"Oltre XR.2 Frameset","manufacturer":"Bianchi","year":2014,"description":"The Oltre XR2 was created for the rider who will settle for nothing but the very best. Developed and continually refined to meet the demands of Pro Tour racers and discerning enthusiasts, the XR2 delivers lightning quick steering, intuitive stability, and unmatched acceleration. Bianchi's proprietary blend of technology - X-Tex, WMP, and UTSS - selectively stiffens and strengthens our most advanced carbon frame. The XR2 carbon formulation sheds 30 grams and strengthens the frame by 20% over our first generation Oltre frame. The Oltre cheats the wind with internal cable routing and proven aerodynamic design features found at the head tube, down tube, fork, aero seat post, and around the sculpted seat tube. BB386 technology rapidly transfers power to the rear wheel while the oversize lower bearing in our well-sculpted head tube keeps its steering on-mark. Oltre literally means beyond. The Oltre XR2 will take you beyond your wildest expectations. Frame: Hoc Oltre Xr2 Carbon, Mechanical/Electronic, New Utss Ss Section, Ht With Integrated Fork, New St Shape, Bb-Pressfit 86,5X46 Sizes 47-50-53-55-57-59-61.","original_msrp":"$4,999.99","paint_description":["Celeste"],"manufacturers_url":"http://www.bianchiusa.com/bikes/road/oltre/oltre-xr2-frameset/#","stock_photo_url":"https://bikebook.s3.amazonaws.com/uploads/Fr/13091/csm_OLTRE_XR.2_9d5df9842a.jpg","stock_photo_small":"https://bikebook.s3.amazonaws.com/uploads/Fr/13091/medium_csm_OLTRE_XR.2_9d5df9842a.jpg"},"components":[{"component_type":"bolts / hardware","description":"Carbon Ti Al7075-T6 Large Button Head Torx M5*14Mm X 4Pcs, Colour Celeste Bianchi With Bianchi Logo","cgroup":"Additional parts"},{"component_type":"seatpost clamp","description":"Included In The Frame","cgroup":"Additional parts"},{"component_type":"headset","description":"Fsa Orbit C-40-Cf-Acb, 11/8 Acb Top, 1.5\" Acb Btm , With 15Mm Carbon Cone Spacer For 46/56Mm Head Tubes","cgroup":"Frame and fork"},{"component_type":"fork","description":"Full Carbon Hoc 1.5\" - 11/8\" Integrated Head","cgroup":"Frame and fork"},{"component_type":"seatpost","description":"Oltre Full Carbon Aero Special Dimension; From 47 To 53 Setback (30Mm), From 55 To 61 Setback (25Mm); Clamp Type Two Bolts","cgroup":"Additional parts"}]}